cask_args appdir: "/Applications"

# Core
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'

# Infra
cask 'docker'

# Dev env
brew 'tmux'
brew 'neovim'
brew 'goenv'
cask 'kitty'
brew 'figlet'
brew 'task'
brew 'fzf'
brew 'jq'
brew 'fd'
brew 'the_silver_searcher'
brew 'kube-ps1'
brew 'shellcheck'
brew 'autojump'
brew 'tree'
brew 'the_silver_searcher'
brew 'bitwarden-cli'
brew 'chezmoi'

# Keyboard stuff
cask 'karabiner-elements'

# Fun
cask 'steam'
brew 'figlet'
brew 'sl'

# Dev Tools
brew 'jq'
brew 'yq'
brew 'kubernetes-cli'
brew 'stern'
brew 'go'
brew 'ssed'
brew 'grpcurl'
brew 'htop'
brew 'nmap'
brew 'kube-ps1'
brew 'iftop'
brew 'tldr'
brew 'shellcheck'

cask 'alacritty'
cask 'caffeine'
cask 'diffmerge'
cask 'firefox'
cask 'keybase'
cask 'mtmr'
cask 'spectacle'
cask 'the-unarchiver'
cask 'tor-browser'
# cask 'visual-studio-code' - Only for emergencies involving teapot
